keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA1_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_H_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA1_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_H_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA1_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_H_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA1_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_L_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA1_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_L_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA1_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_L_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_EN_Bits.ACC_ACK_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_ACC_ACK_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_EN_Bits.ACC_ACK_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_ACC_ACK_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_EN_Bits.ACC_ACK_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_ACC_ACK_IRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA0_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA0_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA0_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA0_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA0_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA0_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA1_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA1_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA1_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA1_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_EN_Bits.NEW_DATA1_IRQ_EN */
#define IFX_GTM_ARU_IRQ_EN_NEW_DATA1_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_ACC_ACK */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_ACC_ACK_OFF (2)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA0_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_FORCINT_Bits.TRG_NEW_DATA */
#define IFX_GTM_ARU_IRQ_FORCINT_TRG_NEW_DATA_OFF (1)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ARU_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.ACC_ACK */
#define IFX_GTM_ARU_IRQ_NOTIFY_ACC_ACK_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.ACC_ACK */
#define IFX_GTM_ARU_IRQ_NOTIFY_ACC_ACK_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.ACC_ACK */
#define IFX_GTM_ARU_IRQ_NOTIFY_ACC_ACK_OFF (2)

/** \\brief  Length for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_IRQ_NOTIFY_Bits.NEW_DATA0 */
#define IFX_GTM_ARU_IRQ_NOTIFY_NEW_DATA0_MSK (0x1)

