keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT3_OFF (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT4_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT4_OFF (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT5_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT5_OFF (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT6_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT6_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT7_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_ATOM_AGC_ENDIS_STAT_ENDIS_STAT7_OFF (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL1_OFF (2)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL2_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL3_OFF (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL4_OFF (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL5_OFF (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL6_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_FUPD_CTRL7_OFF (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH0_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH1_OFF (18)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH2_OFF (20)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH3_OFF (22)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_ATOM_AGC_FUPD_CTRL_RSTCN0_CH4_LEN (2)

