keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL5_OFF (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL6_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_ATOM_AGC_OUTEN_CTRL_OUTEN_CTRL7_OFF (14)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT0_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT1_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT1_OFF (2)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT2_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT2_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT3_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT3_OFF (6)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT4_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT4_OFF (8)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT5_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT5_OFF (10)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT6_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT6_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT7_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_AGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_ATOM_AGC_OUTEN_STAT_OUTEN_STAT7_OFF (14)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_OFF (27)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_MSK (0x1)

