keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_OFF (9)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_OFF (26)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_OFF (20)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_OFF (25)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_OFF (27)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_OFF (6)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_OFF (9)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_OFF (25)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_OFF (2)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ARU_EN_LEN (1)

