keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_TRIGOUT_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU0TC_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU0TC_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU0TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU0TC_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU1TC_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU1TC_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_EN_Bits.CCU1TC_IRQ_EN */
#define IFX_GTM_ATOM_CH_IRQ_EN_CCU1TC_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU0TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU0TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU0TC_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU1TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU1TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_FORCINT_Bits.TRG_CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_FORCINT_TRG_CCU1TC_OFF (1)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ATOM_CH_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ATOM_CH_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_ATOM_CH_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU0TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU0TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU0TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU0TC_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU1TC_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU1TC_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_IRQ_NOTIFY_Bits.CCU1TC */
#define IFX_GTM_ATOM_CH_IRQ_NOTIFY_CCU1TC_OFF (1)

/** \\brief  Length for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_LEN (9)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_LEN (9)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_OFF (21)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_OFF (22)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_MSK (0x1)

