keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST15_OFF (15)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST16_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST16_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST16_OFF (16)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST17_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST17_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST17_OFF (17)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST18_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST18_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST18_OFF (18)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST19_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST19_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST19_OFF (19)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST1_OFF (1)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST20_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST20_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST20_OFF (20)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST21_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST21_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST21_OFF (21)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST2_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST2_OFF (2)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST3_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST4_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST5_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST6_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST7_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST7_OFF (7)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST8_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST8_OFF (8)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST9_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST9_OFF (9)

/** \\brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC2_DEST_EN_TRASHBIN_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC2_DEST_EN_TRASHBIN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC2_DEST_EN_TRASHBIN_OFF (22)

/** \\brief  Length for Ifx_GTM_BRC_SRC3_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC3_ADDR_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_BRC_SRC3_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC3_ADDR_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_BRC_SRC3_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC3_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC3_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC3_ADDR_BRC_MODE_LEN (1)

