keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST19_OFF (19)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST1_OFF (1)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST20_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST20_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST20_OFF (20)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST21_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST21_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST21_OFF (21)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST2_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST2_OFF (2)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST3_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST4_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST5_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST6_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST7_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST7_OFF (7)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST8_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST8_OFF (8)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST9_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC4_DEST_EN_DEST9_OFF (9)

/** \\brief  Length for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC4_DEST_EN_TRASHBIN_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC4_DEST_EN_TRASHBIN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC4_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC4_DEST_EN_TRASHBIN_OFF (22)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC5_ADDR_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC5_ADDR_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC5_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC5_ADDR_BRC_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC5_ADDR_BRC_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC5_ADDR_BRC_MODE_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST0_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST0_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST10_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST10_OFF (10)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST11_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST12_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST12_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC5_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC5_DEST_EN_DEST13_LEN (1)

