keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_LEN (6)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_OFF (26)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_LEN (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_OFF (10)

/** \\brief  Length for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_LEN (5)

/** \\brief  Mask for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_OFF (0)

/** \\brief  Length for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC0_EN_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC10_EN_EIRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC11_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC11_EN_EIRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC1_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC1_EN_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC2_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC2_EN_EIRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC3_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC3_EN_EIRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC4_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC4_EN_EIRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC5_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC5_EN_EIRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC6_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC6_EN_EIRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC7_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC7_EN_EIRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC8_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC8_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC8_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC8_EN_EIRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC9_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC9_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.ABWC9_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_ABWC9_EN_EIRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC0_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC0_EN_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC0_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC0_EN_EIRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC10_EN_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EIRQ_EN_Bits.TBWC10_EN_EIRQ */
#define IFX_GTM_CMP_EIRQ_EN_TBWC10_EN_EIRQ_MSK (0x1)

