keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC6_EN */
#define IFX_GTM_CMP_EN_ABWC6_EN_OFF (6)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC7_EN */
#define IFX_GTM_CMP_EN_ABWC7_EN_OFF (7)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC8_EN */
#define IFX_GTM_CMP_EN_ABWC8_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC8_EN */
#define IFX_GTM_CMP_EN_ABWC8_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC8_EN */
#define IFX_GTM_CMP_EN_ABWC8_EN_OFF (8)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.ABWC9_EN */
#define IFX_GTM_CMP_EN_ABWC9_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.ABWC9_EN */
#define IFX_GTM_CMP_EN_ABWC9_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.ABWC9_EN */
#define IFX_GTM_CMP_EN_ABWC9_EN_OFF (9)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC0_EN */
#define IFX_GTM_CMP_EN_TBWC0_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC0_EN */
#define IFX_GTM_CMP_EN_TBWC0_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC0_EN */
#define IFX_GTM_CMP_EN_TBWC0_EN_OFF (12)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC10_EN */
#define IFX_GTM_CMP_EN_TBWC10_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC10_EN */
#define IFX_GTM_CMP_EN_TBWC10_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC10_EN */
#define IFX_GTM_CMP_EN_TBWC10_EN_OFF (22)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC11_EN */
#define IFX_GTM_CMP_EN_TBWC11_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC11_EN */
#define IFX_GTM_CMP_EN_TBWC11_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC11_EN */
#define IFX_GTM_CMP_EN_TBWC11_EN_OFF (23)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC1_EN */
#define IFX_GTM_CMP_EN_TBWC1_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC1_EN */
#define IFX_GTM_CMP_EN_TBWC1_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC1_EN */
#define IFX_GTM_CMP_EN_TBWC1_EN_OFF (13)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC2_EN */
#define IFX_GTM_CMP_EN_TBWC2_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC2_EN */
#define IFX_GTM_CMP_EN_TBWC2_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC2_EN */
#define IFX_GTM_CMP_EN_TBWC2_EN_OFF (14)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC3_EN */
#define IFX_GTM_CMP_EN_TBWC3_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC3_EN */
#define IFX_GTM_CMP_EN_TBWC3_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC3_EN */
#define IFX_GTM_CMP_EN_TBWC3_EN_OFF (15)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC4_EN */
#define IFX_GTM_CMP_EN_TBWC4_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC4_EN */
#define IFX_GTM_CMP_EN_TBWC4_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC4_EN */
#define IFX_GTM_CMP_EN_TBWC4_EN_OFF (16)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC5_EN */
#define IFX_GTM_CMP_EN_TBWC5_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC5_EN */
#define IFX_GTM_CMP_EN_TBWC5_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC5_EN */
#define IFX_GTM_CMP_EN_TBWC5_EN_OFF (17)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC6_EN */
#define IFX_GTM_CMP_EN_TBWC6_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC6_EN */
#define IFX_GTM_CMP_EN_TBWC6_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC6_EN */
#define IFX_GTM_CMP_EN_TBWC6_EN_OFF (18)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC7_EN */
#define IFX_GTM_CMP_EN_TBWC7_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC7_EN */
#define IFX_GTM_CMP_EN_TBWC7_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC7_EN */
#define IFX_GTM_CMP_EN_TBWC7_EN_OFF (19)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC8_EN */
#define IFX_GTM_CMP_EN_TBWC8_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC8_EN */
#define IFX_GTM_CMP_EN_TBWC8_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC8_EN */
#define IFX_GTM_CMP_EN_TBWC8_EN_OFF (20)

/** \\brief  Length for Ifx_GTM_CMP_EN_Bits.TBWC9_EN */
#define IFX_GTM_CMP_EN_TBWC9_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_EN_Bits.TBWC9_EN */
#define IFX_GTM_CMP_EN_TBWC9_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_EN_Bits.TBWC9_EN */
#define IFX_GTM_CMP_EN_TBWC9_EN_OFF (21)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC10_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC10_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC10_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC10_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC10_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC10_EN_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC11_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC11_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC11_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC11_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC11_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC11_EN_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_OFF (1)

