keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC7_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC7_EN_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC8_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC8_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC8_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC8_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC8_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC8_EN_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC9_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC9_EN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC9_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC9_EN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC9_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC9_EN_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC0_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC0_OFF (0)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC10_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC10_OFF (10)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC11_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC11_OFF (11)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC1_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC1_OFF (1)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC2_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC2_OFF (2)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC3_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC3_OFF (3)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC4_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC4_OFF (4)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC5_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC5_OFF (5)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC6_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC6_OFF (6)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC7_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC7_OFF (7)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC8_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC8_OFF (8)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC9_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_ABWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_ABWC9_OFF (9)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC0_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC0 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC0_OFF (12)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC10_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC10 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC10_OFF (22)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC11_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC11_MSK (0x1)

