keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC11 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC11_OFF (23)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC1_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC1 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC1_OFF (13)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC2_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC2 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC2_OFF (14)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC3_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC3 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC3_OFF (15)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC4_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC4 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC4_OFF (16)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC5_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC5 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC5_OFF (17)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC6_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC6 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC6_OFF (18)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC7_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC7 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC7_OFF (19)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC8_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC8 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC8_OFF (20)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC9_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_FORCINT_Bits.TRG_TBWC9 */
#define IFX_GTM_CMP_IRQ_FORCINT_TRG_TBWC9_OFF (21)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_CMP_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_CMP_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_CMP_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC0 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC0_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC0 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC0 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC0_OFF (0)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC10_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC10_OFF (10)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC11_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC11_OFF (11)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC1 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC1_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC1 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC1 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC1_OFF (1)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC2_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC2_OFF (2)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC3_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC3_OFF (3)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC4_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC4_OFF (4)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC5_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC5_OFF (5)

/** \\brief  Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC6 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC6_LEN (1)

/** \\brief  Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.ABWC6 */
#define IFX_GTM_CMP_IRQ_NOTIFY_ABWC6_MSK (0x1)

