keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_LEN (1)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.RF_PROT */
#define IFX_GTM_CTRL_RF_PROT_OFF (0)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.TO_MODE */
#define IFX_GTM_CTRL_TO_MODE_OFF (1)

/** \\brief  Length for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_LEN (5)

/** \\brief  Mask for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_CTRL_Bits.TO_VAL */
#define IFX_GTM_CTRL_TO_VAL_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_Bits.ACBj_0 */
#define IFX_GTM_DPLL_ACB_ACBJ_0_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_Bits.ACBj_0 */
#define IFX_GTM_DPLL_ACB_ACBJ_0_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_Bits.ACBj_0 */
#define IFX_GTM_DPLL_ACB_ACBJ_0_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_Bits.ACBj_1 */
#define IFX_GTM_DPLL_ACB_ACBJ_1_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_Bits.ACBj_1 */
#define IFX_GTM_DPLL_ACB_ACBJ_1_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_Bits.ACBj_1 */
#define IFX_GTM_DPLL_ACB_ACBJ_1_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_Bits.ACBj_2 */
#define IFX_GTM_DPLL_ACB_ACBJ_2_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_Bits.ACBj_2 */
#define IFX_GTM_DPLL_ACB_ACBJ_2_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_Bits.ACBj_2 */
#define IFX_GTM_DPLL_ACB_ACBJ_2_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_ACB_Bits.ACBj_3 */
#define IFX_GTM_DPLL_ACB_ACBJ_3_LEN (5)

/** \\brief  Mask for Ifx_GTM_DPLL_ACB_Bits.ACBj_3 */
#define IFX_GTM_DPLL_ACB_ACBJ_3_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_DPLL_ACB_Bits.ACBj_3 */
#define IFX_GTM_DPLL_ACB_ACBJ_3_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_Ni */
#define IFX_GTM_DPLL_ACT_STA_ACT_NI_LEN (32)

/** \\brief  Mask for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_Ni */
#define IFX_GTM_DPLL_ACT_STA_ACT_NI_MSK (0xffffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_Ni */
#define IFX_GTM_DPLL_ACT_STA_ACT_NI_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL_1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL_1_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL_1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL_1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL_1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL_1_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL_2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL_2_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL_2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL_2_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL_2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL_2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD_1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD_1_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD_1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD_1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD_1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD_1_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD_2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD_2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_LEN (16)

/** \\brief  Mask for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2a */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2b */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2c */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2d */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_OFF (24)

/** \\brief  Length for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1c3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1c3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_MSK (0x3f)

