keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.LL2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_LL2I_EIRQ_EN_OFF (17)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.MSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MSI_EIRQ_EN_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.MTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_MTI_EIRQ_EN_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PDI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PDI_EIRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PEI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PEI_EIRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.PWI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_PWI_EIRQ_EN_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.SASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SASI_EIRQ_EN_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.SISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SISI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.SISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SISI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.SISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SISI_EIRQ_EN_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TASI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TASI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TASI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TASI_EIRQ_EN_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TAXI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TAXI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TAXI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TAXI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TAXI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TAXI_EIRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE0I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE0I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE0I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE0I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE0I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE0I_EIRQ_EN_OFF (18)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE1I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE1I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE1I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE1I_EIRQ_EN_OFF (19)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_OFF (20)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_OFF (21)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_OFF (22)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TINI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TINI_EIRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TISI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TISI_EIRQ_EN_OFF (5)

