keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL1I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL1I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL1I_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL2I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL2I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_LL2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_LL2I_OFF (17)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MSI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MSI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MSI_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MTI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MTI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MTI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MTI_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PWI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PWI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PWI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PWI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PWI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PWI_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SASI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SASI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SASI_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SORI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SORI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SORI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SORI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SORI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SORI_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TASI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TASI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TASI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TASI_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE0I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE0I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE0I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE0I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE0I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE0I_OFF (18)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE1I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE1I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE1I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE1I_OFF (19)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE2I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE2I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE2I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE2I_OFF (20)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE3I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE3I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE3I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE3I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE3I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE3I_OFF (21)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE4I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE4I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE4I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE4I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TE4I */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TE4I_OFF (22)

