keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.PWI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_PWI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.PWI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_PWI_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SASI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SASI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SASI_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SISI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SISI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SISI_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TAXI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TAXI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TAXI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TAXI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TAXI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TAXI_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_OFF (18)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_OFF (19)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_OFF (20)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_OFF (21)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_OFF (22)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TINI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TINI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TINI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TINI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TINI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TINI_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TISI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TISI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TISI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TISI_OFF (5)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_OFF (12)

/** \\brief  Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_MEDT_S_Bits.MEDT_S */
#define IFX_GTM_DPLL_MEDT_S_MEDT_S_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_MEDT_S_Bits.MEDT_S */
#define IFX_GTM_DPLL_MEDT_S_MEDT_S_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MEDT_S_Bits.MEDT_S */
#define IFX_GTM_DPLL_MEDT_S_MEDT_S_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_MEDT_T_Bits.MEDT_T */
#define IFX_GTM_DPLL_MEDT_T_MEDT_T_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_MEDT_T_Bits.MEDT_T */
#define IFX_GTM_DPLL_MEDT_T_MEDT_T_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MEDT_T_Bits.MEDT_T */
#define IFX_GTM_DPLL_MEDT_T_MEDT_T_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_LEN (18)

/** \\brief  Mask for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_MSK (0x3ffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_LEN (18)

/** \\brief  Mask for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_MSK (0x3ffff)

/** \\brief  Offset for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_LEN (16)

