keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.BWD2 */
#define IFX_GTM_DPLL_STATUS_BWD2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.BWD2 */
#define IFX_GTM_DPLL_STATUS_BWD2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.BWD2 */
#define IFX_GTM_DPLL_STATUS_BWD2_OFF (22)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_OFF (19)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_OFF (18)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_OFF (16)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_OFF (17)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.ERR */
#define IFX_GTM_DPLL_STATUS_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.ERR */
#define IFX_GTM_DPLL_STATUS_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.ERR */
#define IFX_GTM_DPLL_STATUS_ERR_OFF (31)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.FSD */
#define IFX_GTM_DPLL_STATUS_FSD_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.FSD */
#define IFX_GTM_DPLL_STATUS_FSD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.FSD */
#define IFX_GTM_DPLL_STATUS_FSD_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.FTD */
#define IFX_GTM_DPLL_STATUS_FTD_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.FTD */
#define IFX_GTM_DPLL_STATUS_FTD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.FTD */
#define IFX_GTM_DPLL_STATUS_FTD_OFF (29)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.ISN */
#define IFX_GTM_DPLL_STATUS_ISN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.ISN */
#define IFX_GTM_DPLL_STATUS_ISN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.ISN */
#define IFX_GTM_DPLL_STATUS_ISN_OFF (20)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.ITN */
#define IFX_GTM_DPLL_STATUS_ITN_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.ITN */
#define IFX_GTM_DPLL_STATUS_ITN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.ITN */
#define IFX_GTM_DPLL_STATUS_ITN_OFF (21)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.LOCK1 */
#define IFX_GTM_DPLL_STATUS_LOCK1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.LOCK1 */
#define IFX_GTM_DPLL_STATUS_LOCK1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.LOCK1 */
#define IFX_GTM_DPLL_STATUS_LOCK1_OFF (30)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.LOCK2 */
#define IFX_GTM_DPLL_STATUS_LOCK2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.LOCK2 */
#define IFX_GTM_DPLL_STATUS_LOCK2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.LOCK2 */
#define IFX_GTM_DPLL_STATUS_LOCK2_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_OFF (15)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_OFF (12)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_LEN (1)

