keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_F2A_ENABLE_STR0_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_F2A_ENABLE_STR1_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_F2A_ENABLE_STR2_EN_OFF (4)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_F2A_ENABLE_STR3_EN_OFF (6)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_F2A_ENABLE_STR4_EN_OFF (8)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_F2A_ENABLE_STR5_EN_OFF (10)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_F2A_ENABLE_STR6_EN_OFF (12)

/** \\brief  Length for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_F2A_ENABLE_STR7_EN_OFF (14)

/** \\brief  Length for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_F2A_RD_CH_ARU_RD_FIFO_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_LEN (1)

/** \\brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_F2A_STR_CH_STR_CFG_DIR_OFF (18)

/** \\brief  Length for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_F2A_STR_CH_STR_CFG_TMODE_OFF (16)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_FIFO_CH_CTRL_FLUSH_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_FIFO_CH_CTRL_RAP_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_FIFO_CH_CTRL_RBM_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_FIFO_CH_CTRL_WULOCK_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_EMPTY_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_EMPTY_EIRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_FULL_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_FULL_EIRQ_EN_OFF (1)

