keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_LWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_LWM_EIRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.FIFO_UWM_EIRQ_EN */
#define IFX_GTM_FIFO_CH_EIRQ_EN_FIFO_UWM_EIRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_FIFO_CH_EIRQ_EN_RESERVED_LEN (28)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_FIFO_CH_EIRQ_EN_RESERVED_MSK (0xfffffff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_EIRQ_EN_Bits.Reserved */
#define IFX_GTM_FIFO_CH_EIRQ_EN_RESERVED_OFF (4)

/** \\brief  Length for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_LEN (10)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_FIFO_CH_END_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_LEN (11)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_MSK (0x7ff)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_FIFO_CH_FILL_LEVEL_LEVEL_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_LWM_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_UWM */
#define IFX_GTM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_UWM_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYST_DIR */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYST_DIR_OFF (3)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.DMA_HYSTERESIS */
#define IFX_GTM_FIFO_CH_IRQ_MODE_DMA_HYSTERESIS_OFF (2)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_FIFO_CH_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_OFF (0)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_LEN (1)

/** \\brief  Mask for Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_MSK (0x1)

