keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM0_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH0_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH1_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH2_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH3_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH4_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_0_PSM1_CH7_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE0_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE1_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE2_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_0_SPE3_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_LEN (1)

