keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM4_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH1_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH2_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH3_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH4_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH5_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH6_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM5_CH7_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH1_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH3_IRQ_OFF (19)

