keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM6_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH1_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH2_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH3_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH4_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_10_ATOM7_CH7_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH6_IRQ_LEN (1)

