keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_11_ATOM8_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIS_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_CDIT_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_CDIT_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_DCG_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_DCG_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EDI_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_EI_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_MSK (0x1)

