keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_OFF (6)

