keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH6_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH7_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH0_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH7_IRQ_LEN (1)

