keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH10_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH10_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH10_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH11_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH11_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH11_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH12_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH12_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH12_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH13_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH13_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH13_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH14_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH14_IRQ_OFF (14)

