keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH15_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH15_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH15_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH8_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM2_CH9_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH0_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH10_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH10_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH10_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH11_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH11_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH11_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH12_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH12_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH12_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH13_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH13_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH13_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH14_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH14_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH15_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH15_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH15_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH1_IRQ_LEN (1)

