keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH8_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM5_CH9_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM0_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH0_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_LEN (1)

