keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH3_EIRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH4_EIRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH5_EIRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH6_EIRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH7_EIRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH0_EIRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH1_EIRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH2_EIRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH3_EIRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH4_EIRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH5_EIRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH6_EIRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO1_CH7_EIRQ_OFF (15)

