keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH0_EIRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH1_EIRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH2_EIRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH3_EIRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH4_EIRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH5_EIRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH6_EIRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM2_CH7_EIRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH0_EIRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_OFF (0)

