keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH0_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH1_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH2_EIRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS0_CH3_EIRQ_MSK (0x1)

