keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_MSK (0xf)

