keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL4_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL5_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL6_OFF (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL0_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL0_SEL7_OFF (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL8_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL1_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL1_SEL9_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL4_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL5_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL1_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5S_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_PSI5S_OUTSEL_SEL3_LEN (4)

