keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_OFF (14)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_OFF (18)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_OFF (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_OFF (28)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_OFF (2)

/** \\brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_OFF (0)

/** \\brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_OFF (1)

/** \\brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_OFF (3)

/** \\brief  Length for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_OFF (2)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_OFF (0)

/** \\brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_LEN (1)

/** \\brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_MSK (0x1)

