keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_OFF (9)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_LEN (3)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_OFF (16)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MEM_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MEM_ERR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MEM_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MEM_ERR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MEM_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_MEM_ERR_EIRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MEM_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MEM_ERR_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MEM_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MEM_ERR_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MEM_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MEM_ERR_IRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MEM_ERR_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MEM_ERR_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MEM_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MEM_ERR_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_MSK (0x1)

