keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_OFF (17)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_OFF (18)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_OFF (19)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_OFF (20)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_OFF (21)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_OFF (22)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_OFF (23)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_OFF (24)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_OFF (25)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_OFF (26)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_OFF (27)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_OFF (28)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_OFF (29)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_OFF (30)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_OFF (31)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_MSK (0x1)

