keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU6 */
#define IFX_GTM_MON_STATUS_ACT_CMU6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_OFF (8)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_OFF (10)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_OFF (11)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_OFF (16)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_OFF (20)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_OFF (21)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_OFF (22)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_OFF (23)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS4_ERR */
#define IFX_GTM_MON_STATUS_MCS4_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS4_ERR */
#define IFX_GTM_MON_STATUS_MCS4_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS4_ERR */
#define IFX_GTM_MON_STATUS_MCS4_ERR_OFF (24)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS5_ERR */
#define IFX_GTM_MON_STATUS_MCS5_ERR_OFF (25)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL10 */
#define IFX_GTM_MSCIN_INHCON_SEL10_OFF (20)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL11 */
#define IFX_GTM_MSCIN_INHCON_SEL11_OFF (22)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL12 */
#define IFX_GTM_MSCIN_INHCON_SEL12_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL13 */
#define IFX_GTM_MSCIN_INHCON_SEL13_OFF (26)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL14 */
#define IFX_GTM_MSCIN_INHCON_SEL14_OFF (28)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL15 */
#define IFX_GTM_MSCIN_INHCON_SEL15_OFF (30)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INHCON_Bits.SEL1 */
#define IFX_GTM_MSCIN_INHCON_SEL1_OFF (2)

