keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL6 */
#define IFX_GTM_MSCIN_INLCON_SEL6_OFF (12)

/** \\brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL7 */
#define IFX_GTM_MSCIN_INLCON_SEL7_OFF (14)

/** \\brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL8 */
#define IFX_GTM_MSCIN_INLCON_SEL8_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_LEN (2)

/** \\brief  Mask for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MSCIN_INLCON_Bits.SEL9 */
#define IFX_GTM_MSCIN_INLCON_SEL9_OFF (18)

/** \\brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL0 */
#define IFX_GTM_MSCSET_CON0_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL1 */
#define IFX_GTM_MSCSET_CON0_SEL1_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL2 */
#define IFX_GTM_MSCSET_CON0_SEL2_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON0_Bits.SEL3 */
#define IFX_GTM_MSCSET_CON0_SEL3_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL4 */
#define IFX_GTM_MSCSET_CON1_SEL4_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL5 */
#define IFX_GTM_MSCSET_CON1_SEL5_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL6 */
#define IFX_GTM_MSCSET_CON1_SEL6_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON1_Bits.SEL7 */
#define IFX_GTM_MSCSET_CON1_SEL7_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL10 */
#define IFX_GTM_MSCSET_CON2_SEL10_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL11 */
#define IFX_GTM_MSCSET_CON2_SEL11_OFF (24)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL8 */
#define IFX_GTM_MSCSET_CON2_SEL8_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON2_Bits.SEL9 */
#define IFX_GTM_MSCSET_CON2_SEL9_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL12 */
#define IFX_GTM_MSCSET_CON3_SEL12_OFF (0)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL13 */
#define IFX_GTM_MSCSET_CON3_SEL13_OFF (8)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL14 */
#define IFX_GTM_MSCSET_CON3_SEL14_OFF (16)

/** \\brief  Length for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_LEN (5)

/** \\brief  Mask for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_MSCSET_CON3_Bits.SEL15 */
#define IFX_GTM_MSCSET_CON3_SEL15_OFF (24)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_LEN (1)

