keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_OFF (0)

/** \\brief  Length for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_OFF (1)

/** \\brief  Length for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_LEN (2)

/** \\brief  Mask for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_OFF (28)

/** \\brief  Length for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_LEN (27)

/** \\brief  Mask for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_LEN (24)

/** \\brief  Mask for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_OFF (28)

/** \\brief  Length for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_LEN (24)

/** \\brief  Mask for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_OFF (0)

/** \\brief  Length for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_OFF (28)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_OFF (12)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_LEN (3)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_OFF (8)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_OFF (4)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_LEN (3)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_OFF (0)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_OFF (28)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_LEN (3)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_OFF (24)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_OFF (20)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_LEN (3)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_OFF (16)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_OFF (0)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_OFF (4)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_OFF (9)

/** \\brief  Length for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_OFF (0)

/** \\brief  Length for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_MSK (0xf)

