keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.SPE_PAT_PTR */
#define IFX_GTM_SPE_CTRL_STAT_SPE_PAT_PTR_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.SPE_PAT_PTR */
#define IFX_GTM_SPE_CTRL_STAT_SPE_PAT_PTR_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.SPE_PAT_PTR */
#define IFX_GTM_SPE_CTRL_STAT_SPE_PAT_PTR_OFF (8)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.TIM_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TIM_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.TIM_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TIM_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.TIM_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TIM_SEL_OFF (6)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.TRIG_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TRIG_SEL_LEN (2)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.TRIG_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TRIG_SEL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.TRIG_SEL */
#define IFX_GTM_SPE_CTRL_STAT_TRIG_SEL_OFF (4)

/** \\brief  Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_BIS_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_BIS_EIRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_DCHG_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_DCHG_EIRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_NIPD_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_NIPD_EIRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_PERR_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_PERR_EIRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_EIRQ_EN_Bits.SPE_RCMP_EIRQ_EN */
#define IFX_GTM_SPE_EIRQ_EN_SPE_RCMP_EIRQ_EN_OFF (4)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_BIS_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_BIS_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_BIS_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_BIS_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_BIS_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_BIS_IRQ_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_DCHG_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_DCHG_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_DCHG_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_DCHG_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_DCHG_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_DCHG_IRQ_EN_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_NIPD_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_NIPD_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_NIPD_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_NIPD_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_NIPD_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_NIPD_IRQ_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_PERR_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_PERR_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_PERR_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_PERR_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_PERR_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_PERR_IRQ_EN_OFF (2)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_RCMP_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_RCMP_IRQ_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_RCMP_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_RCMP_IRQ_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_EN_Bits.SPE_RCMP_IRQ_EN */
#define IFX_GTM_SPE_IRQ_EN_SPE_RCMP_IRQ_EN_OFF (4)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_BIS */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_BIS_OFF (3)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_DCHG */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_DCHG_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_DCHG */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_DCHG_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_DCHG */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_DCHG_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_NIPD */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_NIPD_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_NIPD */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_NIPD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_NIPD */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_NIPD_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_PERR */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_PERR_OFF (2)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_FORCINT_Bits.TRG_SPE_RCMP */
#define IFX_GTM_SPE_IRQ_FORCINT_TRG_SPE_RCMP_OFF (4)

