keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_OFF (20)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_OFF (25)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP6_VAL */
#define IFX_GTM_SPE_PAT_IP6_VAL_OFF (24)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP7_PAT */
#define IFX_GTM_SPE_PAT_IP7_PAT_OFF (29)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP7_VAL */
#define IFX_GTM_SPE_PAT_IP7_VAL_OFF (28)

/** \\brief  Length for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_LEN (24)

/** \\brief  Mask for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_REV_CMP_Bits.REV_CMP */
#define IFX_GTM_SPE_REV_CMP_REV_CMP_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_LEN (24)

/** \\brief  Mask for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_REV_CNT_Bits.REV_CNT */
#define IFX_GTM_SPE_REV_CNT_REV_CNT_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN (27)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF (1)

/** \\brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_LEN (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF (1)

/** \\brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_LEN (24)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_OFF (1)

/** \\brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF (0)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF (2)

/** \\brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN (2)

/** \\brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF (4)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_MSK (0x1)

