keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_OFF (1)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_OFF (2)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_OFF (3)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_OFF (4)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_OFF (5)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_OFF (6)

/** \\brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_OFF (7)

/** \\brief  Length for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_LEN (24)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_LEN (24)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_OFF (0)

/** \\brief  Length for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_LEN (8)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_OFF (24)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_TIM_CH_CTRL_ARU_EN_OFF (5)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_OFF (6)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_LEN (3)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_OFF (24)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_OFF (12)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.DSL */
#define IFX_GTM_TIM_CH_CTRL_DSL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.DSL */
#define IFX_GTM_TIM_CH_CTRL_DSL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.DSL */
#define IFX_GTM_TIM_CH_CTRL_DSL_OFF (13)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.ECNT_RESET */
#define IFX_GTM_TIM_CH_CTRL_ECNT_RESET_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.ECNT_RESET */
#define IFX_GTM_TIM_CH_CTRL_ECNT_RESET_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.ECNT_RESET */
#define IFX_GTM_TIM_CH_CTRL_ECNT_RESET_OFF (15)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR0_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR0_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR0_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR0_SEL_OFF (28)

/** \\brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR1_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR1_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.EGPR1_SEL */
#define IFX_GTM_TIM_CH_CTRL_EGPR1_SEL_OFF (29)

