keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_CH_STAT_Bits.OL */
#define IFX_GTM_TOM_CH_STAT_OL_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC0_ACT_TB_ACT_TB_LEN (24)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC0_ACT_TB_ACT_TB_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.ACT_TB */
#define IFX_GTM_TOM_TGC0_ACT_TB_ACT_TB_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC0_ACT_TB_TB_TRIG_LEN (1)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC0_ACT_TB_TB_TRIG_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC0_ACT_TB_TB_TRIG_OFF (24)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC0_ACT_TB_TBU_SEL_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC0_ACT_TB_TBU_SEL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC0_ACT_TB_TBU_SEL_OFF (25)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL0_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL1_OFF (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL2_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL2_OFF (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL3_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL3_OFF (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL4_OFF (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL5_OFF (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL6_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC0_ENDIS_CTRL_ENDIS_CTRL7_OFF (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT0_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT1_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT1_OFF (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT2_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT2_OFF (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT3_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT3_OFF (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC0_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC0_ENDIS_STAT_ENDIS_STAT4_OFF (8)

