keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_OFF (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_OFF (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_OFF (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_OFF (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_OFF (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_OFF (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_OFF (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_OFF (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_OFF (14)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_OFF (0)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_OFF (2)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_OFF (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_MSK (0x3)

